In [43]:
import pandas as pd
import numpy as np

In [44]:
df=pd.read_csv("orders (2).csv",usecols=["date","orders"])
df2=pd.read_csv("messages.csv")

In [45]:
df.head()

         date  orders
0  2019-12-10       3
1  2018-08-15     157
2  2018-10-23       1
3  2019-08-17       1
4  2019-01-06       3

In [46]:
df2.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   orders  1000 non-null   int64
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [48]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with dates

In [49]:
df["date"]=pd.to_datetime(df["date"])

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   orders  1000 non-null   int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 15.8 KB

* 1) extract year

In [51]:
df["year"]=df["date"].dt.year
df.head()

        date  orders  year
0 2019-12-10       3  2019
1 2018-08-15     157  2018
2 2018-10-23       1  2018
3 2019-08-17       1  2019
4 2019-01-06       3  2019

In [52]:
# Extract month
df["month"]=df["date"].dt.month
df.head()

        date  orders  year  month
0 2019-12-10       3  2019     12
1 2018-08-15     157  2018      8
2 2018-10-23       1  2018     10
3 2019-08-17       1  2019      8
4 2019-01-06       3  2019      1

In [53]:
# extract month name
df["month_name"]=df["date"].dt.month_name()
df.head()

        date  orders  year  month month_name
0 2019-12-10       3  2019     12   December
1 2018-08-15     157  2018      8     August
2 2018-10-23       1  2018     10    October
3 2019-08-17       1  2019      8     August
4 2019-01-06       3  2019      1    January

In [54]:
# extract day
df["day"]=df["date"].dt.day
df.head()

        date  orders  year  month month_name  day
0 2019-12-10       3  2019     12   December   10
1 2018-08-15     157  2018      8     August   15
2 2018-10-23       1  2018     10    October   23
3 2019-08-17       1  2019      8     August   17
4 2019-01-06       3  2019      1    January    6

In [55]:
# extract day of week
df["day_of_week"]=df["date"].dt.dayofweek
df.head()

        date  orders  year  month month_name  day  day_of_week
0 2019-12-10       3  2019     12   December   10            1
1 2018-08-15     157  2018      8     August   15            2
2 2018-10-23       1  2018     10    October   23            1
3 2019-08-17       1  2019      8     August   17            5
4 2019-01-06       3  2019      1    January    6            6

In [56]:
# Extract day name
df["day_name"]=df["date"].dt.day_name()
df.head()

        date  orders  year  month month_name  day  day_of_week   day_name
0 2019-12-10       3  2019     12   December   10            1    Tuesday
1 2018-08-15     157  2018      8     August   15            2  Wednesday
2 2018-10-23       1  2018     10    October   23            1    Tuesday
3 2019-08-17       1  2019      8     August   17            5   Saturday
4 2019-01-06       3  2019      1    January    6            6     Sunday

In [57]:
#is weekend
df["weekend"]=np.where(df["day_name"].isin(["sunday","Saturday"]),1,0)
df.head()

,date,orders,year,month,month_name,day,day_of_week,day_name,weekend
0,2019-12-10,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,3,2019,1,January,6,6,Sunday,0

In [64]:
# Extract quarter
df["quarter"]=df["date"].dt.quarter
df.head()

,date,orders,year,month,month_name,day,day_of_week,day_name,weekend,quarter
0,2019-12-10,3,2019,12,December,10,1,Tuesday,0,4
1,2018-08-15,157,2018,8,August,15,2,Wednesday,0,3
2,2018-10-23,1,2018,10,October,23,1,Tuesday,0,4
3,2019-08-17,1,2019,8,August,17,5,Saturday,1,3
4,2019-01-06,3,2019,1,January,6,6,Sunday,0,1

In [67]:
# extract semester
df["semester"]=np.where(df["quarter"].isin([1,2]),1,2)
df.head()

,date,orders,year,month,month_name,day,day_of_week,day_name,weekend,quarter,semester
0,2019-12-10,3,2019,12,December,10,1,Tuesday,0,4,2
1,2018-08-15,157,2018,8,August,15,2,Wednesday,0,3,2
2,2018-10-23,1,2018,10,October,23,1,Tuesday,0,4,2
3,2019-08-17,1,2019,8,August,17,5,Saturday,1,3,2
4,2019-01-06,3,2019,1,January,6,6,Sunday,0,1,1

In [69]:
# extract time elapse from date
import datetime
today=datetime.datetime.today()
today

datetime.datetime(2026, 1, 7, 23, 29, 51, 600093)

In [70]:
today-df["date"]

0     2220 days 23:29:51.600093
1     2702 days 23:29:51.600093
2     2633 days 23:29:51.600093
3     2335 days 23:29:51.600093
4     2558 days 23:29:51.600093
                 ...
995   2648 days 23:29:51.600093
996   2589 days 23:29:51.600093
997   2437 days 23:29:51.600093
998   2502 days 23:29:51.600093
999   2276 days 23:29:51.600093
Name: date, Length: 1000, dtype: timedelta64[ns]

In [73]:
(today-df["date"]).dt.days

0      2220
1      2702
2      2633
3      2335
4      2558
       ...
995    2648
996    2589
997    2437
998    2502
999    2276
Name: date, Length: 1000, dtype: int64

In [79]:
np.round((today-df["date"])/np.timedelta64(1,"m"),0)

0      3198210.0
1      3892290.0
2      3792930.0
3      3363810.0
4      3684930.0
         ...
995    3814530.0
996    3729570.0
997    3510690.0
998    3604290.0
999    3278850.0
Name: date, Length: 1000, dtype: float64

In [80]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [86]:
time["date"]=pd.to_datetime(time["date"])
time["min"]=time["date"].dt.minute
time["sec"]=time["date"].dt.second
time["hour"]=time["date"].dt.hour

In [88]:
time.head()

,date,msg,min,sec,hour
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,50,0,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,40,0,23
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,21,0,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,31,0,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,11,0,23

In [90]:
time["time"]=time["date"].dt.time
time.head()

,date,msg,min,sec,hour,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,50,0,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,40,0,23,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,21,0,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,31,0,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,11,0,23,23:11:00

In [91]:
today-time["date"]

0     4406 days 22:39:51.600093
1     4270 days 23:49:51.600093
2     4756 days 23:08:51.600093
3     4058 days 22:58:51.600093
4     4456 days 00:18:51.600093
                 ...
995   5045 days 22:39:51.600093
996   4367 days 00:15:51.600093
997   4831 days 23:52:51.600093
998   4947 days 23:55:51.600093
999   4220 days 00:04:51.600093
Name: date, Length: 1000, dtype: timedelta64[ns]

In [93]:
#in seconds
((today-time["date"])/np.timedelta64(1,"s"))

0      3.807600e+08
1      3.690138e+08
2      4.110017e+08
3      3.506939e+08
4      3.849995e+08
           ...
995    4.359696e+08
996    3.773098e+08
997    4.174844e+08
998    4.275070e+08
999    3.646083e+08
Name: date, Length: 1000, dtype: float64

In [ ]:
# in minutes
((today-time["date"])/np.timedelta64